// @strict-types


#Область ПрограммныйИнтерфейс

#Если МобильныйАвтономныйСервер Тогда
// Выполнить обмен данными.
Процедура ВыполнитьОбменДанными() Экспорт
	НаименованиеУзла = ПараметрыСеанса.ТекущийПользователь.Наименование + " - Автономный узел";
	
	ЦентральныйУзелОбмена = ПланыОбмена.Мобильные.НайтиПоКоду("001");
	Если ЦентральныйУзелОбмена.Пустая() Тогда
		НовыйУзел = ПланыОбмена.Мобильные.СоздатьУзел();
		НовыйУзел.Код="001";
		НовыйУзел.Наименование="Центральный";
		НовыйУзел.Записать();
		ЦентральныйУзелОбмена = НовыйУзел.Ссылка;
	КонецЕсли;
	Узел = ПланыОбмена.Мобильные.ЭтотУзел();

	// Выполнить инициализацию обмена, проверить, есть ли нужный автономный узел в плане обмена.
	НовыйКод = ОсновнойСервер.ОбменМобильныеВызовПК.НачатьОбмен(
			Узел.Код, НаименованиеУзла, ЦентральныйУзелОбмена.НомерПринятого,
			ЦентральныйУзелОбмена.НомерОтправленного);
	Если Узел.Код <> НовыйКод Тогда
		ОбъектУзла = Узел.ПолучитьОбъект();
		ОбъектУзла.Код = НовыйКод;
		ОбъектУзла.Наименование = НаименованиеУзла;
		ОбъектУзла.Записать();
	КонецЕсли;

	ДанныеОбмена = ОбменМобильныеСервер.СформироватьПакетОбмена(ЦентральныйУзелОбмена);
	ДанныеОбмена = ОсновнойСервер.ОбменМобильныеВызовПК.ВыполнитьОбменДанными(Узел.Код, ДанныеОбмена);
	ОбменМобильныеСервер.ПринятьПакетОбмена(ЦентральныйУзелОбмена, ДанныеОбмена);
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
