// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрограммаТренировкиПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПрограммаТренировки) И ИнформацияПоТренировке.Количество() = 0 Тогда
		ПрограммаТренировкиПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрограммаТренировкиПриИзмененииНаСервере()

	 Объект.НомерДня = ПрограммыТренировокСервер.ПолучитьСледующийНомерДняТренировки(Объект.Пользователь, Объект.ПрограммаТренировки);
	 Для Каждого стрУпражнения Из Объект.ПрограммаТренировки.Упражения Цикл
	 	новСтр = ИнформацияПоТренировке.Добавить();
	 	новСтр.Упражнение = стрУпражнения.Упражнение;
	 	новСтр.ИДСтроки = Новый УникальныйИдентификатор();
	 КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ИнформацияПоТренировке_ЗаполнитьПоДаннымДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияПоТренировке_ЗаполнитьПоДаннымДокумента()
	
	ИнформацияПоТренировке.Очистить();
	Для Каждого стрУпражнения Из Объект.Упражнения Цикл
		новСтр = ИнформацияПоТренировке.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, стрУпражнения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
