// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ИнформацияПоТренировке_ПеренестиДанныеВОбъект();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрограммаТренировкиПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПрограммаТренировки) И ИнформацияПоТренировке.Количество() = 0 Тогда
		ПрограммаТренировкиПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрограммаТренировкиПриИзмененииНаСервере()

	ИнформацияПоТренировке_ЗаполнитьПоПрограммеТренировки();
	ИнформацияПоТренировке_ДополнитьИсторией();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ИнформацияПоТренировке_ЗаполнитьПоДаннымДокумента();

КонецПроцедуры

&НаСервере
Процедура ИнформацияПоТренировке_ЗаполнитьПоДаннымДокумента()

	ИнформацияПоТренировке.Очистить();
	Для Каждого стрУпражнения Из Объект.Упражнения Цикл
		новСтр = ИнформацияПоТренировке.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, стрУпражнения);
		новСтр.Факт = ТренировкиКлиентСервер.ПолучитьСтрокуИзПодходов(стрУпражнения.ИДСтроки, Объект.Подходы);
	КонецЦикла;
	
	ИнформацияПоТренировке_ДополнитьИсторией();

КонецПроцедуры

&НаСервере
Процедура ИнформацияПоТренировке_ЗаполнитьПоПрограммеТренировки()

	Объект.НомерДня = ПрограммыТренировокСервер.ПолучитьСледующийНомерДняТренировки(Объект.Пользователь,
		Объект.ПрограммаТренировки);
	Для Каждого стрУпражнения Из Объект.ПрограммаТренировки.Упражения Цикл
		Если стрУпражнения.НомерДня = Объект.НомерДня Тогда
			новСтр = ИнформацияПоТренировке.Добавить();
			новСтр.Упражнение = стрУпражнения.Упражнение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ИнформацияПоТренировке_ДополнитьИсторией()
	СтрукИсторияУпражнений = ПрограммыТренировокСервер.ПолучитьИсториюВыполненияУпражнений(ИнформацияПоТренировке.Выгрузить(, "Упражнение").ВыгрузитьКолонку("Упражнение"), , Объект.Ссылка);
	Если струкИсторияУпражнений <> Неопределено Тогда
		ИнформацияПоТренировке_ДобавитьКолонкиПоОписанию(струкИсторияУпражнений.ОписаниеКолонок);
		ИнформацияПоТренировке_ЗаполнитьПоДаннымИстории(струкИсторияУпражнений);
	КонецЕсли;	 
КонецПроцедуры

//Описание:
// заполняет данные истории в ИнформацияПоТренировке  
//Параметры: 
// ПарамИсторияУпражнений - см. ПрограммыТренировокСервер.ПолучитьИсториюВыполненияУпражнений
&НаСервере
Процедура ИнформацияПоТренировке_ЗаполнитьПоДаннымИстории(ПарамИсторияУпражнений)
	
	ТекЗначенияИстории = ПарамИсторияУпражнений.Значения;
	СтрукПоиск = Новый Структура("Упражнение",Неопределено);
	Для Каждого текЗначениеИстории Из ТекЗначенияИстории Цикл
		ЗаполнитьЗначенияСвойств(СтрукПоиск, текЗначениеИстории);
		МСтрокиПоУпражнению = ИнформацияПоТренировке.НайтиСтроки(СтрукПоиск);
		Для Каждого ТекСтрокаПоУпражнению Из МСтрокиПоУпражнению Цикл
			Для Каждого текОписаниеКолонки Из ПарамИсторияУпражнений.ОписаниеКолонок Цикл
				ТекИмяКолонки = текОписаниеКолонки.Значение;
				ТекСтрокаПоУпражнению[ТекИмяКолонки] = текЗначениеИстории[ТекИмяКолонки]; 
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Описание:
// добавляет колонки в ИнформацияПоТренировке  
//Параметры: 
// ПарамОписаниеКолонок - Соответствие из КлючИЗначение: 
// *Ключ - Дата 
// *Значение - Строка 
&НаСервере
Процедура ИнформацияПоТренировке_ДобавитьКолонкиПоОписанию(ПарамОписаниеКолонок)
	Перем ТекОписаниеКолонки;//Соответствие
	
	МассивРеквизитов = Новый Массив;//Массив из РеквизитФормы
	
	ТекОТСтрока = ОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(100);
	Для Каждого текОписаниеКолонки Из ПарамОписаниеКолонок Цикл
		ТекИмяРеквизита = текОписаниеКолонки.Значение;
		ТекЗаголовок = Формат(текОписаниеКолонки.Ключ, "ДФ=dd.MM.yy;");
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ТекИмяРеквизита, ТекОТСтрока,"ИнформацияПоТренировке",ТекЗаголовок));		 
	КонецЦикла;						
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого текОписаниеКолонки Из ПарамОписаниеКолонок Цикл
		ТекИмяЭлемента = "ИнформацияПоТренировке"+текОписаниеКолонки.Значение;
		НовыйЭлемент = Элементы.Добавить(ТекИмяЭлемента, Тип("ПолеФормы"), Элементы.ИнформацияПоТренировке);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		НовыйЭлемент.ПутьКДанным = "ИнформацияПоТренировке." + текОписаниеКолонки.Значение;		
	КонецЦикла;						
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияПоТренировке_ПеренестиДанныеВОбъект()
	
	Перем ДанныеПодходов;// Массив
	
	Объект.Подходы.Очистить();
	Объект.Упражнения.Очистить();
	Для Каждого СтрИнформацияПоТренировке Из ИнформацияПоТренировке Цикл
		СтрУпражнения = Объект.Упражнения.Добавить();
		СтрУпражнения.Упражнение = СтрИнформацияПоТренировке.Упражнение;
		ТекИДСтроки = Новый УникальныйИдентификатор();
		СтрУпражнения.ИДСтроки = ТекИДСтроки;
		
		ДанныеПодходов = ТренировкиКлиентСервер.РазобратьПодходыИзСтроки(СтрИнформацияПоТренировке.Факт);
		Для Каждого ТекДанныеПодходов Из ДанныеПодходов Цикл
			СтрПодходы = Объект.Подходы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПодходы, ТекДанныеПодходов);
			СтрПодходы.Упражнения_ИДСтроки = ТекИДСтроки;
		КонецЦикла;		  		 
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти