// @strict-types
#Область ОписаниеПеременных
Перем СтарыйКод; //Строка, Неопределено
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	СтарыйКод = Неопределено;
	Если Не ЭтоНовый() Тогда
		СтарыйКод = Ссылка.Код;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Справочники.Пользователи.СоздатьОбновитьПользователяИБ(ЭтотОбъект, СтарыйКод);
	
КонецПроцедуры

#КонецОбласти
