// @strict-types


#Область ПрограммныйИнтерфейс

Процедура НачатьОбмен() Экспорт
	#Если МобильныйКлиент Тогда
		Если ОсновнойСерверДоступен() = Истина Тогда
			ОбменМобильныеАвтономныйСервер.ВыполнитьОбменДанными();
			Оповестить("ОбменЗакончен");
		Иначе
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Обмен невозможен. Недоступен основной сервер.";
			Сообщение.Сообщить();
		КонецЕсли;
	#КонецЕсли		
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
