// @strict-types


#Область ПрограммныйИнтерфейс

// Извлекает строку из хранилища значений.
//
// Параметры:
//   парамХранилищеЗначений - ХранилищеЗначения - хранилище, содержащее строковое значение
//
// Возвращаемое значение:
//   Строка - извлеченная строка или пустая строка, если хранилище не содержит строку
Функция СтрокаИзХранилищаЗначений(парамХранилищеЗначений) Экспорт
	
	Если ТипЗнч(парамХранилищеЗначений) <> Тип("ХранилищеЗначения") Тогда
		Возврат "";
	КонецЕсли;
	текЗнач = парамХранилищеЗначений.Получить();// Произвольный
	
	Если ТипЗнч(текЗнач) = Тип("Строка") Тогда
		Возврат текЗнач;
	КонецЕсли;
	
	Возврат "";

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
