// @strict-types


#Область ПрограммныйИнтерфейс

Функция ОписаниеТипаСтрока(ДлинаСтроки = Неопределено) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	Если ДлинаСтроки <> Неопределено Тогда
		КС = Новый КвалификаторыСтроки(ДлинаСтроки);
		ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Иначе
		ОписаниеТиповС = Новый ОписаниеТипов(Массив);
	КонецЕсли;
	
	Возврат ОписаниеТиповС;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
