// @strict-types


#Область ПрограммныйИнтерфейс


// Разобрать подходы из строки.
// 
// Параметры:
//  СтрокаВвода - Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  	* Повторений - Число 
//  	* Вес - Число
Функция РазобратьПодходыИзСтроки(СтрокаВвода) Экспорт
    
    МассивПодходов = Новый Массив;// Массив из Структура
    
    СтрокаВвода = СокрЛП(СтрокаВвода);
    Если ПустаяСтрока(СтрокаВвода) Тогда
        Возврат МассивПодходов;
    КонецЕсли;
    
    // Обработка первого формата: 3*10;15,25,20
    Если СтрНайти(СтрокаВвода, "*") > 0 Тогда
        
        Части = СтрРазделить(СтрокаВвода, ";");
        Если Части.Количество() <> 2 Тогда
            Возврат МассивПодходов;
        КонецЕсли;
        
        ПодходыПовторения = СтрРазделить(Части[0], "*");
        Если ПодходыПовторения.Количество() <> 2 Тогда
            Возврат МассивПодходов;
        КонецЕсли;
        
        Веса = СтрРазделить(Части[1], ",");
        Повторений = Число(ПодходыПовторения[1]);
        
        Для Каждого ТекВес Из Веса Цикл
            Подход = Новый Структура("Повторений, Вес",Повторений,Число(СокрЛП(ТекВес)));
            МассивПодходов.Добавить(Подход);
        КонецЦикла;
    
    // Обработка второго формата: 10,12,10;25,35,24
    ИначеЕсли СтрНайти(СтрокаВвода, ";") > 0 И СтрНайти(СтрокаВвода, ",") > 0 Тогда
        
        Части = СтрРазделить(СтрокаВвода, ";");
        Если Части.Количество() <> 2 Тогда
            Возврат МассивПодходов;
        КонецЕсли;
        
        Повторения = СтрРазделить(Части[0], ",");
        Веса = СтрРазделить(Части[1], ",");
        
        Если Повторения.Количество() <> Веса.Количество() Тогда
            Возврат МассивПодходов;
        КонецЕсли;
        
        Для i = 0 По Повторения.Количество() - 1 Цикл
            Подход = Новый Структура("Повторений, Вес",Число(СокрЛП(Повторения[i])),Число(СокрЛП(Веса[i])));
            МассивПодходов.Добавить(Подход);
        КонецЦикла;
    
    // Обработка третьего формата: 12-15;15-20
    ИначеЕсли СтрНайти(СтрокаВвода, "-") > 0 Тогда
        
        Подходы = СтрРазделить(СтрокаВвода, ";");
        
        Для Каждого ТекПодход Из Подходы Цикл
            Параметры = СтрРазделить(ТекПодход, "-");
            Если Параметры.Количество() = 2 Тогда
                Подход = Новый Структура("Повторений, Вес", Число(СокрЛП(Параметры[0])), Число(СокрЛП(Параметры[1])));
                МассивПодходов.Добавить(Подход);
            КонецЕсли;
        КонецЦикла;
        
    КонецЕсли;
    
    Возврат МассивПодходов;
    
КонецФункции


// Получить строку из подходов.
// 
// Параметры:
// 	ИдСтроки - УникальныйИдентификатор
//  ТЧПодходы - ТабличнаяЧасть из СтрокаТабличнойЧасти:
//  	* Упражнения_ИДСтроки - УникальныйИдентификатор
//  	* Повторений -Число
//  	* Вес - Число
// 
// Возвращаемое значение: 
// 	Строка
//  
Функция ПолучитьСтрокуИзПодходов(ИдСтроки, ТЧПодходы) Экспорт
	
	ТекВозврат = "";
	
	МСтроки = Новый Массив;//Массив из Строка
	СтрукПоиск = Новый Структура("Упражнения_ИДСтроки", ИдСтроки);
	МНайденныеСтроки = ТЧПодходы.НайтиСтроки(СтрукПоиск);
	Для Каждого СтрПодходы Из МНайденныеСтроки Цикл
		СУпражнение = СтрШаблон("%1-%2",Формат(СтрПодходы.Повторений,"ЧДЦ=0; ЧН=0; ЧГ=0;"),Формат(СтрПодходы.Вес,"ЧДЦ=0; ЧН=0; ЧГ=0;"));
		МСтроки.Добавить(СУпражнение);
	КонецЦикла;
	
	ТекВозврат = СтрСоединить(МСтроки,";");
	
	Возврат ТекВозврат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
