// @strict-types


#Область ПрограммныйИнтерфейс

// Зарегистрировать изменения данных.
// 
// Параметры:
//  УзелОбмена - ПланОбменаСсылка.Мобильные - Узел обмена
Процедура ЗарегистрироватьИзмененияДанных(УзелОбмена) Экспорт
	
	СоставПланаОбмена = УзелОбмена.Метаданные().Состав;
	Для Каждого ЭлементСоставаПланаОбмена Из СоставПланаОбмена Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЭлементСоставаПланаОбмена.Метаданные);
	КонецЦикла;
	
КонецПроцедуры

// Сформировать пакет обмена.
// 
// Параметры:
//  УзелОбмена - ПланОбменаСсылка.Мобильные - Узел обмена
// 
// Возвращаемое значение:
//  ХранилищеЗначения - Сформировать пакет обмена
Функция СформироватьПакетОбмена(УзелОбмена) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
		Данные = ВыборкаИзменений.Получить();
		// Если перенос данных не нужен, то записать удаление данных
		Если Не НуженПереносДанных(Данные, УзелОбмена) Тогда
			УдалениеДанных(Данные);
		КонецЕсли;
		ЗаписатьXML(ЗаписьXML, Данные);
	КонецЦикла;
	
	ЗаписьСообщения.ЗакончитьЗапись();
	
	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));

КонецФункции

// Принять пакет обмена.
// 
// Параметры:
//  УзелОбмена - ПланОбменаСсылка.Мобильные - Узел обмена
//  ДанныеОбмена - ХранилищеЗначения - Данные обмена
Процедура ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ЧтениеXML = Новый ЧтениеXML;
	сСтрокаXML = ОбщегоНазначенияСервер.СтрокаИзХранилищаЗначений(ДанныеОбмена);
	Если сСтрокаXML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеXML.УстановитьСтроку(сСтрокаXML);
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	НачатьТранзакцию();
	Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
	
		Данные = ПрочитатьXML(ЧтениеXML);// ЛюбаяСсылка 
		
		Если НЕ Данные = Неопределено Тогда
			ПринятьИзменения(ЧтениеСообщения.Отправитель, Данные);
		КонецЕсли;
	
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	ЧтениеСообщения.ЗакончитьЧтение();
	ЧтениеXML.Закрыть();

КонецПроцедуры

// Нужен перенос данных.
// 
// Параметры:
//  Данные - Неопределено, УдалениеОбъекта - Данные
//  УзелОбмена - ПланОбменаСсылка.Мобильные - Узел обмена
// 
// Возвращаемое значение:
//  Булево - Нужен перенос данных
Функция НуженПереносДанных(Данные, УзелОбмена) Экспорт
	
	Перенос = Истина;
	#Если НЕ МобильныйАвтономныйСервер Тогда
	Если ТипЗнч(Данные) = Тип("ДокументОбъект.Тренировка") Тогда
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		Владелец = Справочники.Пользователи.НайтиПоКоду(Пользователь);
		Если Данные.Пользователь <> Владелец Тогда
			Перенос = Ложь;
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	
	Возврат Перенос;
	
КонецФункции

// Удаление данных.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, РегистрСведенийНаборЗаписей, УдалениеОбъекта - Данные
Процедура УдалениеДанных(Данные) Экспорт
	
	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных)	ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Данные = Новый УдалениеОбъекта(Данные.Ссылка);
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		Данные.Очистить();
	КонецЕсли;
	
КонецПроцедуры

// Принять изменения.
// 
// Параметры:
//  Отправитель - ПланОбменаСсылкаИмяПланаОбмена - Отправитель
//  Данные - Произвольный - Данные
// 
// Возвращаемое значение:
//  Булево - Принять изменения
Функция ПринятьИзменения(Отправитель, Данные) Экспорт
	
	Прием = Истина;
	Если ПланыОбмена.ИзменениеЗарегистрировано(Отправитель, Данные) Тогда
		#Если НЕ МобильныйАвтономныйСервер Тогда
		Если ТипЗнч(Данные) = Тип("ДокументОбъект.Тренировка") Тогда
			Данные.ОбменДанными.Отправитель = Отправитель;
			Данные.ОбменДанными.Загрузка = Истина;
			Данные.Записать();
		КонецЕсли;
		#КонецЕсли
		#Если МобильныйАвтономныйСервер Тогда
		Если ТипЗнч(Данные) = Тип("СправочникОбъект.Пользователи") Тогда
			Данные.ОбменДанными.Отправитель = Отправитель;
			Данные.ОбменДанными.Загрузка = Истина;
			Данные.Записать();
		ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ПрограммыТренировок") Тогда 
			Данные.ОбменДанными.Отправитель = Отправитель;
			Данные.ОбменДанными.Загрузка = Истина;
			Данные.Записать();
		ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Упражнения") Тогда
			Данные.ОбменДанными.Отправитель = Отправитель;
			Данные.ОбменДанными.Загрузка = Истина;
			Данные.Записать();
		КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	Возврат Прием;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
