// @strict-types


#Область ПрограммныйИнтерфейс

//Описание:
// возвращает номер следующего дня тренировки после последней проведенной пользователем по программе
//Возвращаемое значение: 
// Число - СледующийНомерДняТренировки
//Параметры: 
// Пользователь - СправочникСсылка.Пользователи
// ПрограммаТренировки - СправочникСсылка.ПрограммыТренировок
Функция ПолучитьСледующийНомерДняТренировки(Пользователь, ПрограммаТренировки) Экспорт
	
	ТекВозврат = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	МАКСИМУМ(Тренировка.Дата) КАК Дата,
				   |	&Пользователь КАК Пользователь,
				   |	&ПрограммаТренировки КАК ПрограммаТренировки
				   |ПОМЕСТИТЬ ВТ_ДатаПоследнейТренировки
				   |ИЗ
				   |	Документ.Тренировка КАК Тренировка
				   |ГДЕ
				   |	Тренировка.Пользователь = &Пользователь
				   |	И Тренировка.ПрограммаТренировки = &ПрограммаТренировки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	Тренировка.НомерДня КАК НомерДня
				   |ПОМЕСТИТЬ ВТ_НомерПоследнегоДняТренировки
				   |ИЗ
				   |	ВТ_ДатаПоследнейТренировки КАК ВТ_ДатаПоследнейТренировки
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Тренировка КАК Тренировка
				   |		ПО ВТ_ДатаПоследнейТренировки.Пользователь = Тренировка.Пользователь
				   |			И ВТ_ДатаПоследнейТренировки.Дата = Тренировка.Дата
				   |			И ВТ_ДатаПоследнейТренировки.ПрограммаТренировки = Тренировка.ПрограммаТренировки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	МАКСИМУМ(ВложенныйЗапрос.НомерДня) КАК НомерДня
				   |ИЗ
				   |	(ВЫБРАТЬ
				   |		МИНИМУМ(ПрограммыТренировокУпражения.НомерДня) КАК НомерДня
				   |	ИЗ
				   |		Справочник.ПрограммыТренировок.Упражения КАК ПрограммыТренировокУпражения
				   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НомерПоследнегоДняТренировки КАК ВТ_НомерПоследнегоДняТренировки
				   |			ПО ПрограммыТренировокУпражения.НомерДня > ВТ_НомерПоследнегоДняТренировки.НомерДня
				   |				И (ПрограммыТренировокУпражения.Ссылка = &ПрограммаТренировки)
				   |	
				   |	ОБЪЕДИНИТЬ ВСЕ
				   |	
				   |	ВЫБРАТЬ
				   |		1) КАК ВложенныйЗапрос";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрограммаТренировки", ПрограммаТренировки);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекВозврат = Выборка.НомерДня;
	КонецЦикла;
	
	Возврат ТекВозврат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
