// @strict-types


#Область ПрограммныйИнтерфейс

// Начать обмен.
// 
// Параметры:
//  КодУзла - Строка - Код узла
//  НаименованиеМобильногоКомпьютера - Строка - Наименование мобильного компьютера
//  НомерОтправленного - Число - Номер отправленного
//  НомерПринятого  - Число - Номер принятого
// 
// Возвращаемое значение:
//  Строка - Начать обмен
Функция НачатьОбмен(КодУзла, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	УзелОбмена = ПланыОбмена.Мобильные.ЭтотУзел().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(УзелОбмена.Код) Тогда
		УзелОбмена.Код = "001";
		УзелОбмена.Наименование = "Центральный";
		УзелОбмена.Записать();
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.Мобильные.НайтиПоКоду(КодУзла);
	
	Если УзелОбмена.Пустая() Тогда
		НовыйУзел = ПланыОбмена.Мобильные.СоздатьУзел();
		НачатьТранзакцию();
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Константа.КодНовогоУзлаПланаОбмена");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		КодНовогоУзла = Константы.КодНовогоУзлаПланаОбмена.Получить();
		Если КодНовогоУзла = 0 Тогда
			КодНовогоУзла = 2;
		КонецЕсли;
		Константы.КодНовогоУзлаПланаОбмена.Установить(КодНовогоУзла + 1);
		ЗафиксироватьТранзакцию();
		Если СтрДлина(КодНовогоУзла) < 3 Тогда
			НовыйУзел.Код = Формат(КодНовогоУзла, "ЧЦ=3; ЧВН=");
		Иначе
			НовыйУзел.Код = Строка(КодНовогоУзла);
		КонецЕсли;
		НовыйУзел.Наименование = НаименованиеМобильногоКомпьютера;
		НовыйУзел.НомерОтправленного = НомерОтправленного;
		НовыйУзел.НомерПринятого = НомерПринятого;
		НовыйУзел.Записать();
		ОбменМобильныеСервер.ЗарегистрироватьИзмененияДанных(НовыйУзел.Ссылка);
		УзелОбмена = НовыйУзел.Ссылка;
	Иначе
		Если УзелОбмена.ПометкаУдаления ИЛИ УзелОбмена.Наименование <> НаименованиеМобильногоКомпьютера Тогда
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.ПометкаУдаления = Ложь;
			Узел.Наименование = НаименованиеМобильногоКомпьютера;
			Узел.Записать();
		КонецЕсли;

		Если УзелОбмена.НомерОтправленного <>  НомерОтправленного ИЛИ УзелОбмена.НомерПринятого <> НомерПринятого Тогда
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.НомерОтправленного = НомерОтправленного;
			Узел.НомерПринятого = НомерПринятого;
			Узел.Записать();
			ОбменМобильныеСервер.ЗарегистрироватьИзмененияДанных(УзелОбмена);
		КонецЕсли;
	КонецЕсли;
	
	Возврат УзелОбмена.Код;
	
КонецФункции

// Выполнить обмен данными.
// 
// Параметры:
//  КодУзла - Строка - Код узла
//  ДанныеМобильногоПриложения  Данные мобильного приложения
// 
// Возвращаемое значение:
//  ХранилищеЗначения - Выполнить обмен данными
Функция ВыполнитьОбменДанными(КодУзла, ДанныеМобильногоПриложения) Экспорт

	УзелОбмена = ПланыОбмена.Мобильные.НайтиПоКоду(КодУзла);
	
	Если УзелОбмена.Пустая() Тогда
		ВызватьИсключение("Неизвестное устройство - " + КодУзла);
	КонецЕсли;
	ОбменМобильныеСервер.ПринятьПакетОбмена(УзелОбмена, ДанныеМобильногоПриложения);
	
	Возврат ОбменМобильныеСервер.СформироватьПакетОбмена(УзелОбмена);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
