#Область ОбработчикиСобытий

Процедура ПриИзмененииДоступностиОсновногоСервера(НачалоСеансаОсновногоСервера)

	#Если МобильныйКлиент Тогда
		Если ОсновнойСерверДоступен() = Истина Тогда
			ОбменМобильныеАвтономныйКлиент.НачатьОбмен();
		КонецЕсли;
	#КонецЕсли		

КонецПроцедуры

// @strict-types
Процедура ПриНачалеРаботыСистемы()
	
	#Если МобильныйКлиент Тогда
		Если ОсновнойСерверДоступен() = Истина Тогда
			ОбменМобильныеАвтономныйКлиент.НачатьОбмен();
		КонецЕсли;
	#КонецЕсли		
		
КонецПроцедуры

#КонецОбласти
